package org.config;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@NoArgsConstructor
@AllArgsConstructor
@Getter
public enum JkzhGetValueModelEnum {
    //参数解析模型：1-主动土压力计算、2-被动土压力计算、3-土压力零点计算、4-支撑轴力计算
    /**事件类型 0:回退事件 1:正常进行 2:拒绝/作废 **/
    主动土压力计算 (1,"主动土压力计算"),
    被动土压力计算(2,"被动土压力计算"),
    土压力零点所在土层(3,"土压力零点所在土层"),
    主动土压力零点深度计算(4,"主动土压力零点深度计算"),
    被动土压力零点深度计算(5,"被动土压力零点深度计算"),
    主动支撑轴力计算(6,"主动支撑轴力计算"),
    被动支撑轴力计算(7,"被动支撑轴力计算"),
    土压力系数计算(87,"土压力系数计算"),
    主动土压力合力计算(9,"主动土压力合力计算"),
    主动作用点位置(10,"主动作用点位置"),
    被动土压力合力计算(11,"被动土压力合力计算"),
    被动作用点位置(12,"被动作用点位置"),
    支撑轴力计算(13,"支撑轴力计算"),

    剪力为零处主动土底面压力强度(14,"剪力为零处主动土底面压力强度"),
    剪力为零这层土的主动土压力合力(15,"剪力为零这层土的主动土压力合力"),
    剪力为零这层土的主动作用点位置(16,"剪力为零这层土的主动作用点位置"),
    土层之上各主动土压力合力之和(17,"土层之上各主动土压力合力之和"),
    土层之上各被动土压力合力之和(18,"土层之上各被动土压力合力之和"),
    两个支点之间支撑轴力汇总(19,"两个支点之间支撑轴力汇总"),
    最大弯矩位置(20,"最大弯矩位置"),
    最大弯矩支撑轴矩(21,"最大弯矩支撑轴矩"),
    最大弯矩主动土合矩(22,"最大弯矩主动土合矩"),
    最大弯矩被动土合矩(23,"最大弯矩被动土合矩"),
    最大弯矩(24,"最大弯矩"),
    最后一个支点到基坑底面重算主动土压力合力(25,"最后一个支点到基坑底面重算主动土压力合力"),
    重新计算基坑底面切面主动土压力(26,"重新计算基坑底面切面主动土压力"),
    剪力为零处被动土底面压力强度(27,"剪力为零处被动土底面压力强度"),
    剪力为零这层土的被动土压力合力(28,"剪力为零这层土的被动土压力合力"),
    剪力为零这层土的被动作用点位置(29,"剪力为零这层土的被动作用点位置"),
    基坑底面以下主动土压力合力之和(30,"基坑底面以下主动土压力合力之和"),
    基坑底面以下被动土压力合力之和(31,"基坑底面以下被动土压力合力之和"),
    ;
    private Integer type;
    private String typeName;
}
