package org.table;


/**
 * 基坑支护设计排桩法基本土质参数表
 */
public class SoilQualityTable implements ITable {
    //土层参数计算依据表
    // 层号    土层名称    土层厚度    土的重度    黏聚力    内摩擦角(°)
    //土层参数计算依据表头

    //土压力系数头
    private String[][] table = {
            {"岩土层分布（从上至下）及分布特征序号", "土层名称","厚度(m)\nh","重度(kN/m3)\nγ","黏聚力(kPa)\nc","内摩擦角(°)\nΨ","计算方式"},
            {"1", "①2素填土","2.30","19.30","8.00","4.00","水土合算"},
            {"2", "④1粘土","2.40","18.50","7.80","3.50","水土合算"},
            {"3", "⑥2淤泥质粘土","3.30","17.50","3.80","3.50","水土合算"},
            {"4", "⑥3粉质粘土","9.00","19.10","12.50","13.30","水土合算"},
            {"5", "⑦粘土","2.00","17.90","12.40","5.50","水土合算"},
            {"6", "⑧1粉质粘土","3.00","20.40","14.10","10.70","水土合算"},
            {"7", "⑧2粉土","4.90","20.00","10.80","26.90","水土分算"},
            {"8", "⑨1粉质粘土","6","19.70","14.80","16.50","水土合算"},
    };

    @Override
    public String[][] getTable() {
        return this.table;
    }

    public void setTable(String[][] table){
        this.table = table;
    }
}
